___

<a href='https://www.purwadhika.com/'> <img style="height: 200px" src='https://www.dicoding.com/images/original/event/201705181703334cc2c00c0d639e4593a12a55aa4c8103.png' /></a>
___

# SF Salaries Exercise 

Welcome to a quick exercise for you to practice your pandas skills! We will be using the [SF Salaries Dataset](https://www.kaggle.com/kaggle/sf-salaries) from Kaggle! Just follow along and complete the tasks outlined in bold below. The tasks will get harder and harder as you go along.

**Import pandas as pd.**

In [3]:
import numpy as np
import pandas as pd

**Read Salaries.csv as a dataframe called sal.**

In [4]:
sal=pd.read_csv('Salaries.csv')

**Check the head of the DataFrame.**

In [5]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

**Use the .info() method to find out how many entries there are.**

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 13.0+ MB

In [6]:
# display info
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

**What is the average BasePay ?**

66325.4488404877

In [7]:
# mean of BasePay
sal['BasePay'].mean()

66325.44884050643

**What is the highest amount of OvertimePay in the dataset ?**

245131.88

In [8]:
# the maximum amount of OvertimePay
sal['OvertimePay'].max()

245131.88

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                609
OvertimePay              4
OtherPay                 4
Benefits             36163
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              148654
dtype: int64

In [36]:
# menghitung jumlah Null/NaN dalam masing2 series di dataframe
sal.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                609
OvertimePay              4
OtherPay                 4
Benefits             36163
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              148654
dtype: int64

**What is the job title of  JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll).**

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [37]:
# indexing dgn condition
JOSEPH = sal['EmployeeName']=='JOSEPH DRISCOLL'

# menampilkan JobTitle dari condition (index yg memiliki EmployeeName JOSEPH DRISCOLL)
sal[JOSEPH]['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [11]:
# cara lain menggunakan loc
sal.loc[sal['EmployeeName']=='JOSEPH DRISCOLL', 'JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

       EmployeeName                   JobTitle
24  JOSEPH DRISCOLL  CAPTAIN, FIRE SUPPRESSION

In [12]:
# menampilkan EmployeeName dan JobTitle dari condition
sal[JOSEPH[['EmployeeName','JobTitle']]

       EmployeeName                   JobTitle
24  JOSEPH DRISCOLL  CAPTAIN, FIRE SUPPRESSION

In [13]:
# cara lain menggunakan loc
sal.loc[sal['EmployeeName']=='JOSEPH DRISCOLL', ['EmployeeName','JobTitle']]

       EmployeeName                   JobTitle
24  JOSEPH DRISCOLL  CAPTAIN, FIRE SUPPRESSION

**How much does JOSEPH DRISCOLL make (including benefits)?**

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [14]:
# indexing penghasilan total JOSEPH DRISCOLL
sal.loc[sal['EmployeeName']=='JOSEPH DRISCOLL', 'TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

** What is the name of highest paid person (including benefits)?**

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [15]:
# mencari nilai/angka max dari TotalPayBenefits
maxTotalPayBenefits = sal['TotalPayBenefits'].max()

# indexing siapa yg punya maxTotalPayBenefits dalam kolom TotalPayBenefits
sal[sal['TotalPayBenefits'] == maxTotalPayBenefits]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [51]:
# ditulis dalam 1 baris
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,len_JobTitle
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN,46

In [50]:
# idxmax() untuk mencari index dengan nilai maximum dari suatu kolom
sal.loc[[sal['TotalPayBenefits'].idxmax()]]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,len_JobTitle
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN,46

In [49]:
sal.sort_values('TotalPayBenefits', ascending=False).head(1)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,len_JobTitle
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN,46

In [52]:
# untuk memunculkan EmployeeName nya saja
# dgn cara indexing kolom, lalu .loc[]
sal['EmployeeName'].loc[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].max()]

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

** What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [16]:
# mencari nilai minimum dari TotalPayBenefits
minTotalPayBenefits = sal['TotalPayBenefits'].min()

# indexing siapa yg punya minimum TotalPayBenefits
sal[sal['TotalPayBenefits'] == minTotalPayBenefits]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [53]:
# ditulis dalam 1 baris
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,len_JobTitle
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN,26

** What was the average (mean) BasePay of all employees per year? (2011-2014) ? **

In [17]:
# mencari nilai mean berdasarkan tahun
meanYear = sal.groupby('Year').mean()

# indexing khusus untuk kolom BasePay
meanYear['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [18]:
# ditulis dalam 1 baris
# cara lain indexing, setelah mencari mean dari groupby
sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [ ]:
# cara penulisan lain, method mean() diletakkan setelah indexing kolom BasePay
sal.groupby('Year')['BasePay'].mean()

** How many unique job titles are there? **

2159

In [19]:
# mencari jumlah JobTitle berbeda (unique)
sal['JobTitle'].nunique()

2159

** What are the top 5 most common jobs? **

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [20]:
# menghitung jumlah JobTitle berbeda
count_JobTitle = sal.groupby('JobTitle').count()

# mengurutkan dari jumlah yg terbanyak
count_JobTitle.sort_values('EmployeeName', ascending=False).head()['EmployeeName']

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: EmployeeName, dtype: int64

In [59]:
# cara lain
# outputnya berupa dataframe
sal.groupby('JobTitle', as_index=False).count().reset_index().sort_values('EmployeeName', ascending=False).head()[['JobTitle','EmployeeName']]

                          JobTitle  EmployeeName
2056              Transit Operator          7036
1902                 Special Nurse          4389
1577              Registered Nurse          3736
1544  Public Svc Aide-Public Works          2518
1482              Police Officer 3          2421

In [57]:
# value_counts() menghitung value yg sama dalam suatu kolom
# outputnya berupa series
sal['JobTitle'].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

** How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?) **

202

In [21]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [22]:
# slicing data hanya pada tahun 2013
sal2013 = sal[sal['Year']==2013]
sal2013.head(3)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
72925,72926,Gregory P Suhr,Chief of Police,319275.01,0.00,20007.06,86533.21,339282.07,425815.28,2013,NaN,San Francisco,NaN
72926,72927,Joanne M Hayes-White,"Chief, Fire Department",313686.01,0.00,23236.00,85431.39,336922.01,422353.40,2013,NaN,San Francisco,NaN
72927,72928,Samson Lai,"Battalion Chief, Fire Suppress",186236.42,131217.63,29648.27,57064.95,347102.32,404167.27,2013,NaN,San Francisco,NaN

In [63]:
# mengelompokkan JobTitle
group_JobTitle = sal2013.groupby('JobTitle').count() 
group_JobTitle

# mencari JobTitle yg hanya dimiliki oleh 1 orang saja
oneJobOneMan = group_JobTitle[group_JobTitle['EmployeeName']==1]
oneJobOneMan

# menghitung jumlah JobTitle yg hanya dimiliki oleh 1 orang saja berdasarkan EmployeeName
oneJobOneMan['EmployeeName'].count()

202

In [72]:
# ditulis dalam 1 baris
sal[sal['Year']==2013].groupby('JobTitle').count()[sal[sal['Year']==2013].groupby('JobTitle').count()['EmployeeName']==1]['EmployeeName'].count()

202

In [61]:
# menggunakan value_counts() supaya ga kepanjangan pake groupby() dan count()
(sal.loc[sal['Year']==2013,'JobTitle'].value_counts()==1).sum()

202

** How many people have the word Chief in their job title? **

627

In [78]:
sal['JobTitle'].str.lower().str.contains('chief').sum()

627

In [81]:
# mencari yg ada kata Chief nya
chief = sal[sal['JobTitle'].str.contains('Chief'.lower())]

# menghitung berapa orang dgn pekerjaan yg ada kata Chief nya
chief['EmployeeName'].count()

0

** Bonus: Is there a correlation between length of the Job Title string and Salary? **

In [46]:
# membuat series/kolom baru bernama len_JobTitle berisi panjang string dari JobTitle
sal['len_JobTitle'] = sal['JobTitle'].str.len()
sal.head()

# indexing kolom len_JobTitle dan TotalPayBenefits
# lalu diurutkan berdasarkan TotalPayBenefits dari yg terbesar
sal[['len_JobTitle','TotalPayBenefits']].sort_values('TotalPayBenefits', ascending=False).head(20)

# maka bisa dilihat len_JobTitle dan TotalPayBenefits tidak berhubungan
# ketika TotalPayBenefits makin sedikit, len_JobTitle tidak menjadi lebih sedikit

        len_JobTitle  TotalPayBenefits
0                 46         567595.43
1                 31         538909.28
110531            14         510732.68
110532            17         479652.21
110533            24         436224.36
72925             15         425815.28
72926             22         422353.40
110534            15         418019.22
110535            22         417435.10
110536            17         415767.94
36159             28         407274.78
72927             30         404167.27
72928             17         401736.88
110537            11         401070.87
110538            27         398984.53
72929             28         398421.67
72930             28         396778.68
72931             27         395632.03
110539            30         395361.86
72932             11         395334.45

In [82]:
sal[['len_JobTitle','TotalPayBenefits']].corr()
# correlation antara len_JobTitle dan TotalPayBenefits sebesar -0.036878 (buruk)

                  len_JobTitle  TotalPayBenefits
len_JobTitle          1.000000         -0.036878
TotalPayBenefits     -0.036878          1.000000

## There is NO CORRELATION between length of the Job Title string and Salary

# Great Job!